Revit 2027 API
ValueAtPointBase.ClearFlagsAt Method
 Sets flags for the given measurement to ValueAtPointFlags::None.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void ClearFlagsAt(
	int measurement
)
Public Sub ClearFlagsAt (
	measurement As Integer
)
public:
void ClearFlagsAt(
	int measurement
)
member ClearFlagsAt :
        measurement : int -> unit
Parameters
measurement Int32
 Measurement for which to clear flags.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  The given value for measurement is negative.
See Also
Reference
ValueAtPointBase Class
Autodesk.Revit.DB Namespace